packages/artillery-tests/src/term-server/bulk-lookup-term-server.yml
config:
  target: "{{ $processEnvironment.TERM_SERVER_URL }}"
  phases:
    - duration: 10
      arrivalRate: 3
      name: Warm up
    - duration: 10
      arrivalRate: 4
      rampTo: 16
      name: Ramp up load
  processor: "./term-server.js"
  variables:
    count: 250

scenarios:
  - name: "Bulk Lookup Term Server"
    flow:
      - loop:
          - function: "generateParameters"
          - post:
              url: "/terminology/code-system/lookup/bulk"
              json: "{{ params }}"
        count: 1