packages/artillery-tests/src/term-server/bulk-lookup-term-server.yml
config:
  target: "{{ $processEnvironment.TERM_SERVER_URL }}"
  phases:
    - duration: 10
      arrivalRate: 10
      name: Warm up
    - name: Pause
      pause: 10
    - duration: 60
      arrivalRate: 1
      rampTo: 20
      name: Ramp up load
  processor: "./term-server.js"

scenarios:
  - name: "Bulk Lookup Term Server"
    flow:
      - loop:
          - function: "generateParameters"
          - post:
              url: "/terminology/code-system/lookup/bulk"
              json: "{{ params }}"
        count: 5